# Taps
tap "dashlane/tap"
tap "opencode-ai/tap"
tap "koekeishiya/formulae"

# CLI
brew "awscli"
brew "bat"
brew "bats-core"
brew "btop"
brew "cargo-binstall"
brew "dashlane/tap/dashlane-cli"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "fzf-tab"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "jq"
brew "k9s"
brew "kubectl"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "neovim"
brew "opencode-ai/tap/opencode"
brew "ripgrep"
brew "starship"
brew "stern"
brew "stow"
brew "tldr"
brew "trash"
brew "tree-sitter-cli"
brew "typescript"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Image processing (used by Snacks.image in Neovim)
brew "imagemagick"

# Terminal + multiplexer
cask "ghostty"
brew "zellij"
brew "koekeishiya/formulae/skhd"

# Fonts
cask "font-blex-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Runtime managers
brew "mise"
brew "rust"
brew "rustup-init"

# Apps (optional)
cask "1password"
cask "brave-browser"
cask "codex"
cask "docker-desktop"
cask "gcloud-cli"
cask "karabiner-elements"
cask "obsidian"
cask "raycast"
cask "spotify"
cask "zed"
