# CLI
brew "git"
brew "stow"
brew "neovim"
brew "tree-sitter-cli"
brew "typescript"
brew "starship"
brew "lazygit"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "fzf-tab"
brew "bat"
brew "jq"
brew "zoxide"
brew "eza"
brew "yazi"
brew "kubectl"
brew "awscli"
brew "lazydocker"
brew "cargo-binstall"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "mas"

# Image processing (used by Snacks.image in Neovim)
brew "imagemagick"

# Terminal + multiplexer
cask "ghostty"
brew "zellij"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Runtime managers
brew "mise"
brew "rust"
brew "rustup-init"

# Apps (optional)
cask "raycast"
cask "zed"
cask "obsidian"
cask "brave-browser"
cask "spotify"
cask "docker-desktop"
cask "codex"
cask "gcloud-cli"
cask "amethyst"
