[
  "calendar",
  "code-styler",
  "dataview",
  "obsidian-excalidraw-plugin",
  "obsidian-file-color",
  "file-explorer-note-count",
  "file-explorer-plus",
  "github-sync",
  "homepage",
  "obsidian-icon-folder",
  "obsidian-leaflet-plugin",
  "lovely-mindmap",
  "nldates-obsidian",
  "omnisearch",
  "obsidian-paste-image-rename",
  "rainbow-colored-sidebar",
  "settings-search",
  "unique-attachments",
  "text-extractor",
  "templater-obsidian",
  "tag-wrangler",
  "obsidian-style-settings",
  "obsidian-sort-and-permute-lines"
]